tutorials/fluidSolidInteraction/cerebralAneurysm/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "Outlet[1-4]"
    {
        type inletOutlet;
        value uniform (0 0 0);
        inletValue uniform (0 0 0);
    }

    "Inlet[1-2]"
    {
        type                flowRateInletVelocity;
        volumetricFlowRate  table
        (
            (0       2.966000e-06)
            (0.01    2.979000e-06)
            (0.02    3.097000e-06)
            (0.03    3.364000e-06)
            (0.04    3.866000e-06)
            (0.05    4.552000e-06)
            (0.06    5.522000e-06)
            (0.07    6.835000e-06)
            (0.08    7.789000e-06)
            (0.09    8.329000e-06)
            (0.1     8.295000e-06)
            (0.11    8.085000e-06)
            (0.12    7.819000e-06)
            (0.13    7.542000e-06)
            (0.14    7.219000e-06)
            (0.15    6.957000e-06)
            (0.16    6.735000e-06)
            (0.17    6.548000e-06)
            (0.18    6.430000e-06)
            (0.19    6.325000e-06)
            (0.2     6.251000e-06)
            (0.21    6.224000e-06)
            (0.22    6.240000e-06)
            (0.23    6.271000e-06)
            (0.24    6.312000e-06)
            (0.25    6.341000e-06)
            (0.26    6.345000e-06)
            (0.27    6.287000e-06)
            (0.28    6.205000e-06)
            (0.29    6.079000e-06)
            (0.3     5.931000e-06)
            (0.31    5.748000e-06)
            (0.32    5.539000e-06)
            (0.33    5.340000e-06)
            (0.34    5.126000e-06)
            (0.35    4.949000e-06)
            (0.36    4.801000e-06)
            (0.37    4.688000e-06)
            (0.38    4.655000e-06)
            (0.39    4.688000e-06)
            (0.4     4.777000e-06)
            (0.41    4.876000e-06)
            (0.42    5.015000e-06)
            (0.43    5.135000e-06)
            (0.44    5.234000e-06)
            (0.45    5.293000e-06)
            (0.46    5.331000e-06)
            (0.47    5.325000e-06)
            (0.48    5.292000e-06)
            (0.49    5.255000e-06)
            (0.5     5.194000e-06)
            (0.51    5.145000e-06)
            (0.52    5.080000e-06)
            (0.53    5.007000e-06)
            (0.54    4.919000e-06)
            (0.55    4.839000e-06)
            (0.56    4.740000e-06)
            (0.57    4.651000e-06)
            (0.58    4.562000e-06)
            (0.59    4.497000e-06)
            (0.6     4.423000e-06)
            (0.61    4.358000e-06)
            (0.62    4.293000e-06)
            (0.63    4.236000e-06)
            (0.64    4.184000e-06)
            (0.65    4.123000e-06)
            (0.66    4.076000e-06)
            (0.67    4.028000e-06)
            (0.68    3.990000e-06)
            (0.69    3.947000e-06)
            (0.7     3.931000e-06)
            (0.71    3.893000e-06)
            (0.72    3.859000e-06)
            (0.73    3.823000e-06)
            (0.74    3.787000e-06)
            (0.75    3.754000e-06)
            (0.76    3.722000e-06)
            (0.77    3.696000e-06)
            (0.78    3.656000e-06)
            (0.79    3.625000e-06)
            (0.8     3.593000e-06)
            (0.81    3.561000e-06)
            (0.82    3.526000e-06)
            (0.83    3.499000e-06)
            (0.84    3.464000e-06)
            (0.85    3.432000e-06)
            (0.86    3.400000e-06)
            (0.87    3.368000e-06)
            (0.88    3.336000e-06)
            (0.89    3.320000e-06)
            (0.9     3.283000e-06)
            (0.91    3.255000e-06)
            (0.92    3.215000e-06)
            (0.93    3.187000e-06)
            (0.94    3.153000e-06)
            (0.95    3.106000e-06)
            (0.96    3.081000e-06)
            (0.97    3.046000e-06)
            (0.98    2.999000e-06)
            (0.99    2.978000e-06)
            (1       2.957000e-06)
        );
        outOfBounds repeat;
        value uniform (0 0 0);

    }
    "Wall"
    {
        // Dirichlet-Neumann approach
        // type         newMovingWallVelocity;
        // value        uniform (0 0 0);

        // Robin-Neumann condition approach
        type         elasticWallVelocity;
        value        uniform (0 0 0);
    }
}

// ************************************************************************* //
