tutorials/fluidSolidInteraction/cerebralAneurysm/0/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "Outlet[1-4]"
    {
        type fixedValue;
        value uniform 0;
    }
    "Inlet[1-2]"
    {
        type zeroGradient;
    }
    "Wall"
    {
        // Dirichlet-Neumann approach
        // type        movingWallPressure;
        // value       uniform 0;

        // Robin-Neumann condition approach
        type        elasticWallPressure;
        constantHs  3e-4;
        value       uniform 0;
    }
}

// ************************************************************************* //
