tutorials/fluidSolidInteraction/cerebralAneurysm/0/fluid/pointMotionU
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointMotionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "Outlet[1-4]"
    {
        type         fixedValue;
        value        uniform (0 0 0);
    }
     "Inlet[1-2]"
    {
        type         fixedValue;
        value        uniform (0 0 0);
    }
    "Wall"
    {
        type         fixedValue;
        value        uniform (0 0 0);
    }
}

// ************************************************************************* //
