tutorials/fluidSolidInteraction/cerebralAneurysm/constant/solid/solidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//solidModel linearGeometry;
solidModel linearGeometryTotalDisplacement;
//solidModel nonLinearGeometryUpdatedLagrangian;

"linearGeometryCoeffs|linearGeometryTotalDisplacementCoeffs|nonLinearGeometryUpdatedLagrangianCoeffs"
{
    solutionAlgorithm PETScSNES;

    // Maximum number of momentum correctors
    // nCorrectors             5000;

    // Solution tolerance for displacement
    solutionTolerance       1e-06;

    // Alternative solution tolerance for displacement
    alternativeTolerance    1e-06;

    // Material law solution tolerance
    materialTolerance       1e-06;

    // Write frequency for the residuals
    infoFrequency           100;

    // Predict displacement field at the start of a time step using the velocity
    predictor               yes;

    stabilisation
    {
        momentum
        {
            type        RhieChow;
            //type        alpha;
            scaleFactor 0.5;
        }
    }

}

// ************************************************************************* //
